# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [3]:
#Your code here
import sqlite3
import pandas as pd
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [9]:
#Your code here
cursor.execute('''SELECT * FROM employees
JOIN offices
ON employees.officeCode = offices.officeCode;''')

df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df[df['city'] == 'Boston']

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143,Sales Rep,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143,Sales Rep,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA

## Do any offices have no employees?

In [14]:
#Your code here
df['employeeNumber'].isnull().any()

False

## Write 3 Questions of your own and answer them

In [46]:
# Answers will vary
# How many different employees are at each office?
emp_by_office = df.groupby('city', sort=True)['employeeNumber'].count().reset_index()
emp_by_office.sort_values('employeeNumber', ascending = False)

            city  employeeNumber
4  San Francisco               6
3          Paris               5
5         Sydney               4
0         Boston               2
1         London               2
2            NYC               2
6          Tokyo               2

In [85]:
# What's the main office?
df.pivot_table(values='employeeNumber', index='city', columns='jobTitle', aggfunc=lambda x: len(x.unique()))

# Looks like it is San Francisco, as that is where the President, VP, Marketing, etc. reside

jobTitle,President,Sale Manager (EMEA),Sales Manager (APAC),Sales Manager (NA),Sales Rep,VP Marketing,VP Sales
city,,,,,,,
Boston,NaN,NaN,NaN,NaN,2.0,NaN,NaN
London,NaN,NaN,NaN,NaN,2.0,NaN,NaN
NYC,NaN,NaN,NaN,NaN,2.0,NaN,NaN
Paris,NaN,1.0,NaN,NaN,4.0,NaN,NaN
San Francisco,1.0,NaN,NaN,1.0,2.0,1.0,1.0
Sydney,NaN,NaN,1.0,NaN,3.0,NaN,NaN
Tokyo,NaN,NaN,NaN,NaN,2.0,NaN,NaN

In [93]:
# Your code here
df.pivot_table(index='jobTitle', columns='reportsTo', values='employeeNumber', aggfunc=lambda x: len(x.unique()))

reportsTo                  1002  1056  1088  1102  1143  1621
jobTitle
President             1.0   NaN   NaN   NaN   NaN   NaN   NaN
Sale Manager (EMEA)   NaN   NaN   1.0   NaN   NaN   NaN   NaN
Sales Manager (APAC)  NaN   NaN   1.0   NaN   NaN   NaN   NaN
Sales Manager (NA)    NaN   NaN   1.0   NaN   NaN   NaN   NaN
Sales Rep             NaN   NaN   1.0   3.0   6.0   6.0   1.0
VP Marketing          NaN   1.0   NaN   NaN   NaN   NaN   NaN
VP Sales              NaN   1.0   NaN   NaN   NaN   NaN   NaN

## Level Up: Display the names of each product each employee has sold.

In [106]:
# Your code here
cursor.execute("""SELECT firstName, lastName, productName
                      FROM employees e
                      JOIN customers c
                      ON e.employeeNumber = c.salesRepEmployeeNumber
                      JOIN orders o
                      USING (customerNumber)
                      JOIN orderdetails od
                      USING (orderNumber)
                      JOIN products p
                      USING (productCode);""")
df = pd.DataFrame(cursor.fetchall())
df.columns = [i[0] for i in cursor.description]
df.groupby('lastName')['productName'].count()

lastName
Bondur       177
Bott         236
Castillo     272
Firrelli     124
Fixter       185
Gerard       114
Hernandez    396
Jennings     331
Jones        220
Marsh        185
Nishi        137
Patterson    152
Thompson     114
Tseng        142
Vanauf       211
Name: productName, dtype: int64

## Level Up: Display the Number of Products each Employee Has sold

In [116]:
#Your code here
df.groupby(['lastName'])['productName'].value_counts()

lastName  productName
Bondur    1982 Ducati 996 R                            5
          1957 Vespa GS150                             4
          1961 Chevrolet Impala                        4
          2001 Ferrari Enzo                            4
          2002 Yamaha YZR M1                           4
          1932 Model A Ford J-Coupe                    3
          1939 Chevrolet Deluxe Coupe                  3
          1957 Corvette Convertible                    3
          1962 City of Detroit Streetcar               3
          1969 Dodge Super Bee                         3
          1969 Ford Falcon                             3
          1969 Harley Davidson Ultimate Chopper        3
          1974 Ducati 350 Mk3 Desmo                    3
          1976 Ford Gran Torino                        3
          1982 Camaro Z28                              3
          1982 Ducati 900 Monster                      3
          2002 Suzuki XREO                             3
          Diamond T620 Semi-Skirted Tanker             3
          1903 Ford Model A                            2
          1911 Ford Town Car                           2
          1917 Grand Touring Sedan                     2
          1926 Ford Fire Engine                        2
          1928 Mercedes-Benz SSK                       2
          1932 Alfa Romeo 8C2300 Spider Sport          2
          1936 Harley Davidson El Knucklehead          2
          1936 Mercedes-Benz 500K Special Roadster     2
          1937 Lincoln Berline                         2
          1938 Cadillac V-16 Presidential Limousine    2
          1940s Ford truck                             2
          1948 Porsche Type 356 Roadster               2
                                                      ..
Vanauf    1941 Chevrolet Special Deluxe Cabriolet      1
          1948 Porsche 356-A Roadster                  1
          1949 Jaguar XK 120                           1
          1952 Alpine Renault 1300                     1
          1956 Porsche 356A Coupe                      1
          1957 Corvette Convertible                    1
          1957 Vespa GS150                             1
          1961 Chevrolet Impala                        1
          1962 LanciaA Delta 16V                       1
          1962 Volkswagen Microbus                     1
          1966 Shelby Cobra 427 S/C                    1
          1968 Dodge Charger                           1
          1968 Ford Mustang                            1
          1969 Chevrolet Camaro Z28                    1
          1969 Corvair Monza                           1
          1969 Dodge Charger                           1
          1969 Dodge Super Bee                         1
          1969 Ford Falcon                             1
          1970 Chevy Chevelle SS 454                   1
          1970 Plymouth Hemi Cuda                      1
          1971 Alpine Renault 1600s                    1
          1974 Ducati 350 Mk3 Desmo                    1
          1980s Black Hawk Helicopter                  1
          1980â€™s GM Manhattan Express                  1
          1982 Ducati 996 R                            1
          2001 Ferrari Enzo                            1
          2002 Chevy Corvette                          1
          2002 Yamaha YZR M1                           1
          Collectable Wooden Train                     1
          The Mayflower                                1
Name: productName, Length: 1368, dtype: int64

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!

In [ ]:
# Finished January 11, 2019